# 1.จงเขียนตารางสูตรคูณให้ผลลัพท์ที่ออกมาเป็นแบบตัวอย่างด้านล่างโดยใช้คำสั่ง while
i = 2
while i <= 12:
    print("   " + "[", i, "]")
    j = 1
    while j <= 12:
        print(i, "*", j, ":", i * j)
        j += 1
    print("")
    print("---------------" "\n")
    i += 1

#2.จงเขียนตารางสูตรคูณให้ผลลัพท์ที่ออกมาเป็นแบบตัวอย่างด้านล่างโดยใช้คำสั่ง for
for i in range(1, 13):
    print("   " + "[", i, "]")
    for j in range(1, 13):
        print(i, "*", j, ":", i * j)
    print("--------------")